GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
/*
 * Copyright (c) 2017-2020 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0xx.h"

#include "stm32l0_gpio.h"
#include "stm32l0_exti.h"
#include "stm32l0_i2c.h"
#include "stm32l0_dma.h"
#include "stm32l0_system.h"

extern void I2C1_IRQHandler(void);
extern void I2C2_IRQHandler(void);
#if defined(STM32L072xx) || defined(STM32L082xx)
extern void I2C3_IRQHandler(void);
#endif /* STM32L072xx || STM32L082xx */

typedef struct _stm32l0_i2c_device_t {
    stm32l0_system_notify_t notify;
    volatile uint32_t       wakeup;
    stm32l0_i2c_t           *instances[STM32L0_I2C_INSTANCE_COUNT];
} stm32l0_i2c_device_t;

static stm32l0_i2c_device_t stm32l0_i2c_device;

#define STM32L0_I2C_TX_DMA_OPTION \
    (STM32L0_DMA_OPTION_MEMORY_TO_PERIPHERAL |   \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |     \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |  \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_I2C_RX_DMA_OPTION \
    (STM32L0_DMA_OPTION_PERIPHERAL_TO_MEMORY |   \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_8 | \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |     \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |  \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define I2C_CR1_DNF_SHIFT    8
#define I2C_CR2_NBYTES_MAX   255
#define I2C_CR2_NBYTES_SHIFT 16
#define I2C_CR2_NBYTES_MASK  0x00ff0000

#define STM32L0_I2C_SUSPEND_CALLBACK ((stm32l0_i2c_suspend_callback_t)2)

static I2C_TypeDef * const stm32l0_i2c_xlate_I2C[STM32L0_I2C_INSTANCE_COUNT] = {
    I2C1,
    I2C2,
#if defined(STM32L072xx) || defined(STM32L082xx)
    I2C3,
#endif /* STM32L072xx || STM32L082xx */
};

static const IRQn_Type stm32l0_i2c_xlate_IRQn[STM32L0_I2C_INSTANCE_COUNT] = {
    I2C1_IRQn,
    I2C2_IRQn,
#if defined(STM32L072xx) || defined(STM32L082xx)
    I2C3_IRQn,
#endif /* STM32L072xx || STM32L082xx */
};

static const uint32_t stm32l0_i2c_xlate_FMP[STM32L0_I2C_INSTANCE_COUNT] = {
    SYSCFG_CFGR2_I2C1_FMP,
    SYSCFG_CFGR2_I2C2_FMP,
#if defined(STM32L072xx) || defined(STM32L082xx)
    SYSCFG_CFGR2_I2C3_FMP,
#endif /* STM32L072xx || STM32L082xx */
};

static const uint32_t stm32l0_i2c_xlate_IMR[STM32L0_I2C_INSTANCE_COUNT] = {
    EXTI_IMR_IM23,
    0,
#if defined(STM32L072xx) || defined(STM32L082xx)
    EXTI_IMR_IM24,
#endif /* STM32L072xx || STM32L082xx */
};

static void stm32l0_i2c_notify_callback(void *context, uint32_t notify)
{
    /* WAR for ERRATA 2.6.1 */

    if (stm32l0_i2c_device.wakeup)
    {
        if (notify & STM32L0_SYSTEM_NOTIFY_STOP_ENTER)
        {
            if (stm32l0_i2c_device.wakeup & (1u << STM32L0_I2C_INSTANCE_I2C1))
            {
                I2C1->CR1 &= ~I2C_CR1_PE;
            }

#if defined(STM32L072xx) || defined(STM32L082xx)
            if (stm32l0_i2c_device.wakeup & (1u << STM32L0_I2C_INSTANCE_I2C3))
            {
                I2C3->CR1 &= ~I2C_CR1_PE;
            }
#endif /* STM32L072xx || STM32L082xx */
        }

        if (notify & STM32L0_SYSTEM_NOTIFY_STOP_LEAVE)
        {
            if (stm32l0_i2c_device.wakeup & (1u << STM32L0_I2C_INSTANCE_I2C1))
            {
                I2C1->CR1 |= I2C_CR1_PE;
            }

#if defined(STM32L072xx) || defined(STM32L082xx)
            if (stm32l0_i2c_device.wakeup & (1u << STM32L0_I2C_INSTANCE_I2C3))
            {
                I2C3->CR1 |= I2C_CR1_PE;
            }
#endif /* STM32L072xx || STM32L082xx */
        }
    }
}

static void stm32l0_i2c_start(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;
    uint32_t pclk, i2c_timingr;

    stm32l0_system_periph_enable(STM32L0_SYSTEM_PERIPH_I2C1 + i2c->instance);

    if (i2c->instance == STM32L0_I2C_INSTANCE_I2C2)
    {
        stm32l0_system_lock(STM32L0_SYSTEM_LOCK_RUN);

        pclk = stm32l0_system_pclk1();

        if (i2c->option & STM32L0_I2C_OPTION_MODE_400K)
        {
            /* tRise = 125ns, tFall = 13ns, AF, DNF = 0 */
            if      (pclk == 32000000) { i2c_timingr = 0x00700f33; }
            else if (pclk == 16000000) { i2c_timingr = 0x00300618; }
            else if (pclk ==  8000000) { i2c_timingr = 0x0010020a; }
            else                       { i2c_timingr = 0x00000102; }
        }
        else
        {
            /* tRise = 125ns, tFall = 13ns, AF, DNF = 0 */
            if      (pclk == 32000000) { i2c_timingr = 0x00b07cb6; }
            else if (pclk == 16000000) { i2c_timingr = 0x00503d59; }
            else if (pclk ==  8000000) { i2c_timingr = 0x00201d2b; }
            else                       { i2c_timingr = 0x00100d14; }
        }
        
