GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
        I2C->TIMINGR = i2c_timingr;
    }
    else
    {
        stm32l0_system_hsi16_enable();

        if ((i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK) && !(i2c->option & STM32L0_I2C_OPTION_WAKEUP))
        {
            armv6m_atomic_or(&stm32l0_i2c_device.wakeup, (1u << i2c->instance));
        }
    }

    I2C->CR1 |= I2C_CR1_PE;
}

static void stm32l0_i2c_stop(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;

    /* WAR for ERRATA 2.6.1 */
    I2C->CR1 &= ~I2C_CR1_PE;

    if (i2c->instance == STM32L0_I2C_INSTANCE_I2C2)
    {
        stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_RUN);
    }
    else
    {
        if ((i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK) && !(i2c->option & STM32L0_I2C_OPTION_WAKEUP))
        {
            armv6m_atomic_and(&stm32l0_i2c_device.wakeup, ~(1u << i2c->instance));
        }

        stm32l0_system_hsi16_disable();
    }

    stm32l0_system_periph_disable(STM32L0_SYSTEM_PERIPH_I2C1 + i2c->instance);
}

static void stm32l0_i2c_sync(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;
    uint32_t i2c_cr1, i2c_cr2, i2c_oar1, i2c_oar2, i2c_timingr, i2c_timeoutr;

    i2c->rq_sync = false;

    if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK)
    {
        stm32l0_i2c_stop(i2c);

        armv6m_atomic_and(&EXTI->IMR, ~stm32l0_i2c_xlate_IMR[i2c->instance]);
    }
    
    armv6m_atomic_and(&SYSCFG->CFGR1, ~stm32l0_i2c_xlate_FMP[i2c->instance]);

    stm32l0_system_periph_enable(STM32L0_SYSTEM_PERIPH_I2C1 + i2c->instance);

    I2C->CR1 = 0;
    
    i2c_cr1 = 0;
    i2c_cr2 = 0;
    i2c_oar1 = 0;
    i2c_oar2 = 0;
    i2c_timingr = 0;
    i2c_timeoutr = 0;

    if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK)
    {
        i2c_oar1 = I2C_OAR1_OA1EN | (((i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK) >> STM32L0_I2C_OPTION_ADDRESS_SHIFT) << 1);

        if (i2c->option & STM32L0_I2C_OPTION_GENERAL_CALL)
        {
            i2c_cr1 |= I2C_CR1_GCEN;
        }

        i2c_cr1 |= I2C_CR1_ADDRIE;

        if (i2c->option & STM32L0_I2C_OPTION_WAKEUP)
        {
            i2c_cr1 |= I2C_CR1_WUPEN;

            armv6m_atomic_or(&EXTI->IMR, stm32l0_i2c_xlate_IMR[i2c->instance]);
        }

        I2C->TIMINGR = 0x00300000;
        I2C->TIMEOUTR = 0;
    }
    else
    {
        if (i2c->instance != STM32L0_I2C_INSTANCE_I2C2)
        {
            if  (i2c->option & STM32L0_I2C_OPTION_MODE_1000K)
            {
                armv6m_atomic_or(&SYSCFG->CFGR1, stm32l0_i2c_xlate_FMP[i2c->instance]);
            }
                
            /* tRise =  62ns, tFall = 10ns, no AF, DNF = 1 (FMP)    */
            /* tRise = 125ns, tFall = 13ns, no AF, DNF = 1 (FM, SM) */
            i2c_cr1 |= (I2C_CR1_ANFOFF | (1 << I2C_CR1_DNF_SHIFT));
            
            if      (i2c->option & STM32L0_I2C_OPTION_MODE_1000K) { i2c_timingr = 0x00100106; }
            else if (i2c->option & STM32L0_I2C_OPTION_MODE_400K)  { i2c_timingr = 0x00300618; }
            else                                                  { i2c_timingr = 0x00503c5a; }

            if (i2c->timeout) 
            {
                i2c_timeoutr = ((i2c->timeout * 125) + 15) / 16 -1;
                
                if (i2c_timeoutr > 4095)
                {
                    i2c_timeoutr = 4095;
                }
                
                i2c_timeoutr |= I2C_TIMEOUTR_TIMOUTEN;
            }

            I2C->TIMINGR = i2c_timingr;
            I2C->TIMEOUTR = i2c_timeoutr;
        }
        else
        {
            I2C->TIMEOUTR = 0;
        }
    }

    I2C->OAR2 = i2c_oar2;
    I2C->OAR1 = i2c_oar1;
    I2C->CR2 = i2c_cr2;
    I2C->CR1 = i2c_cr1;

    if (i2c->option & STM32L0_I2C_OPTION_WAKEUP)
    {
        stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PARK_NONE | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
        stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PARK_NONE | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
    }
    else
    {
        stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
        stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
    }

    stm32l0_system_periph_disable(STM32L0_SYSTEM_PERIPH_I2C1 + i2c->instance);

    if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK) 
    {
        stm32l0_i2c_start(i2c);
    }
}

static void stm32l0_i2c_master_transmit(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;
    uint32_t i2c_cr2, count;
    bool tx_dma = false;

    i2c->state = STM32L0_I2C_STATE_MASTER_TRANSMIT;

    count = i2c->tx_data_e - i2c->tx_data;

    i2c_cr2 = (i2c->xf_address << 1) | I2C_CR2_START;

    if (count > I2C_CR2_NBYTES_MAX)
    {
        count = I2C_CR2_NBYTES_MAX;

        i2c_cr2 |= I2C_CR2_RELOAD;
    }
    else
    {
        if (!i2c->rx_data && !(i2c->xf_control & STM32L0_I2C_CONTROL_RESTART))
        {
            i2c_cr2 |= I2C_CR2_AUTOEND;
        }
    }

    if ((count > 1) && (i2c->tx_dma != STM32L0_DMA_CHANNEL_NONE))
    {
        tx_dma = stm32l0_dma_channel(i2c->tx_dma);
        
        if (!tx_dma)
        {
            tx_dma = stm32l0_dma_enable(i2c->tx_dma, NULL, NULL);
        }
    }

    if ((count > 1) && tx_dma)
    {
        I2C->CR1 |= I2C_CR1_TXDMAEN;

        stm32l0_dma_start(i2c->tx_dma, (uint32_t)&I2C->TXDR, (uint32_t)i2c->tx_data, (i2c->tx_data_e - i2c->tx_data), STM32L0_I2C_TX_DMA_OPTION);

        I2C->CR2 = (i2c_cr2 | (count << I2C_CR2_NBYTES_SHIFT));

        I2C->CR1 |= (I2C_CR1_STOPIE | I2C_CR1_TCIE);

        I2C->ISR |= I2C_ISR_TXE;

        i2c->tx_data += count;
    }
    else
    {
        I2C->CR2 = (i2c_cr2 | (count << I2C_CR2_NBYTES_SHIFT));

        I2C->CR1 |= (I2C_CR1_TXIE | I2C_CR1_STOPIE | I2C_CR1_TCIE);

        I2C->ISR |= I2C_ISR_TXE;

        I2C->TXDR = *(i2c->tx_data)++;
    }
}

