GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
static void stm32l0_i2c_master_receive(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;
    uint32_t i2c_cr2, count;
    bool rx_dma = false;

    i2c->state = STM32L0_I2C_STATE_MASTER_RECEIVE;

    count = i2c->rx_data_e - i2c->rx_data;

    i2c_cr2 = (i2c->xf_address << 1) | I2C_CR2_RD_WRN | I2C_CR2_START;

    /* WAR for ERRATA if NBYTES != 1 and RELOAD is set. This case is handled by using
     * interrupt driven receive mode with NBYTES set to 1 for each byte. This is
     * only affecting receive operations with more than I2C_CR2_NBYTES_MAX bytes.
     */

    if (count > I2C_CR2_NBYTES_MAX)
    {
        count = 1;

        i2c_cr2 |= I2C_CR2_RELOAD;
    }
    else
    {
        if (!(i2c->xf_control & STM32L0_I2C_CONTROL_RESTART))
        {
            i2c_cr2 |= I2C_CR2_AUTOEND;
        }
    }

    if ((count > 1) && (i2c->rx_dma != STM32L0_DMA_CHANNEL_NONE))
    {
        rx_dma = stm32l0_dma_channel(i2c->rx_dma);

        if (!rx_dma)
        {
            rx_dma = stm32l0_dma_enable(i2c->rx_dma, NULL, NULL);
        }
    }

    if ((count > 1) && rx_dma)
    {
        I2C->CR1 |= I2C_CR1_RXDMAEN;

        stm32l0_dma_start(i2c->rx_dma, (uint32_t)i2c->rx_data, (uint32_t)&I2C->RXDR, (i2c->rx_data_e - i2c->rx_data), STM32L0_I2C_RX_DMA_OPTION);

        I2C->CR2 = (i2c_cr2 | (count << I2C_CR2_NBYTES_SHIFT));

        I2C->CR1 |= (I2C_CR1_STOPIE | I2C_CR1_TCIE);

        i2c->rx_data += count;
    }
    else
    {
        I2C->CR2 = (i2c_cr2 | (count << I2C_CR2_NBYTES_SHIFT));

        if (count == 1)
        {
            /* No need to trigger an extra RXNE interrupt if only one byte 
             * is read. TCR/TC will cover that.
             */
            I2C->CR1 |= (I2C_CR1_STOPIE | I2C_CR1_TCIE);
        }
        else
        {
            I2C->CR1 |= (I2C_CR1_RXIE | I2C_CR1_STOPIE | I2C_CR1_TCIE);
        }
    }
}

static void stm32l0_i2c_master_check(stm32l0_i2c_t *i2c)
{
    stm32l0_i2c_transaction_t *transaction, **pp_transaction, *entry, **pp_entry;

    if (i2c->xf_queue)
    {
        if ((i2c->state != STM32L0_I2C_STATE_SUSPENDED) && ((i2c->state == STM32L0_I2C_STATE_MASTER_RESTART) || !i2c->rq_callback))
        {
            do
            {
                transaction = NULL;
                
                for (pp_entry = &i2c->xf_queue, entry = *pp_entry; entry; pp_entry = &entry->next, entry = *pp_entry) 
                {
                    if ((i2c->state != STM32L0_I2C_STATE_MASTER_RESTART) || (i2c->xf_address == entry->address))
                    {
                        transaction = entry;
                        pp_transaction = pp_entry;
                    }
                }
                
                if (!transaction)
                {
                    break;
                }
            }
            while (armv6m_atomic_cas((volatile uint32_t*)pp_transaction, (uint32_t)transaction, (uint32_t)NULL) != (uint32_t)transaction);
        
            if (transaction)
            {
                if (i2c->state == STM32L0_I2C_STATE_READY)
                {
                    stm32l0_system_lock(STM32L0_SYSTEM_LOCK_SLEEP);
                
                    stm32l0_i2c_start(i2c);
                }

                i2c->xf_transaction = transaction;
            
                i2c->xf_address = transaction->address;
                i2c->xf_control = transaction->control;
            
                i2c->tx_data = NULL;
                i2c->tx_data_e = NULL;
                i2c->rx_data = NULL;
                i2c->rx_data_e = NULL;
            
                if (transaction->rx_data)
                {
                    i2c->rx_data = transaction->rx_data;
                    i2c->rx_data_e = transaction->rx_data + transaction->rx_count;
                }
            
                if (transaction->tx_data)
                {
                    i2c->tx_data = transaction->tx_data;
                    i2c->tx_data_e = transaction->tx_data + transaction->tx_count;
                
                    stm32l0_i2c_master_transmit(i2c);
                }
                else
                {
                    stm32l0_i2c_master_receive(i2c);
                }
            }
        }
    }

    if (!i2c->xf_transaction)
    {
        if (i2c->state == STM32L0_I2C_STATE_MASTER_STOP)
        {
            if (stm32l0_dma_channel(i2c->rx_dma))
            {
                stm32l0_dma_disable(i2c->rx_dma);
            }

            if (stm32l0_dma_channel(i2c->tx_dma))
            {
                stm32l0_dma_disable(i2c->tx_dma);
            }
            
            stm32l0_i2c_stop(i2c);

            stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_SLEEP);

            i2c->state = STM32L0_I2C_STATE_READY;
        }

        if (i2c->state == STM32L0_I2C_STATE_READY)
        {
            if (i2c->rq_sync)
            {
                stm32l0_i2c_sync(i2c);
            }

            if (i2c->rq_callback)
            {
                stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
                stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
                
                i2c->state = STM32L0_I2C_STATE_SUSPENDED;

                NVIC_DisableIRQ(i2c->interrupt);

                if (i2c->rq_callback != STM32L0_I2C_SUSPEND_CALLBACK)
                {
                    (*i2c->rq_callback)(i2c->rq_context);
                }

                i2c->rq_callback = NULL;
            }
        }
    }
}

static void stm32l0_i2c_slave_check(stm32l0_i2c_t *i2c)
{
    if (i2c->rq_sync)
    {
        stm32l0_i2c_sync(i2c);
    }

    if (i2c->rq_callback)
    {
        stm32l0_i2c_stop(i2c);

        stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
        stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
        
        i2c->state = STM32L0_I2C_STATE_SUSPENDED;

