GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
        NVIC_DisableIRQ(i2c->interrupt);

        if (i2c->rq_callback != STM32L0_I2C_SUSPEND_CALLBACK)
        {
            (*i2c->rq_callback)(i2c->rq_context);
        }
        
        i2c->rq_callback = NULL;
    }
}

static void stm32l0_i2c_slave_address(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;

    i2c->xf_address = (I2C->ISR >> 17) & 0x7f;
    i2c->xf_count = 0;

    if (I2C->ISR & I2C_ISR_DIR)
    {
        i2c->state = STM32L0_I2C_STATE_SLAVE_TRANSMIT;

        i2c->tx_data = NULL;
        i2c->tx_data_e = NULL;

        (*i2c->ev_callback)(i2c->ev_context, STM32L0_I2C_EVENT_TRANSMIT_REQUEST | (i2c->xf_address << STM32L0_I2C_EVENT_ADDRESS_SHIFT));

        I2C->CR2 = 0;
            
        I2C->CR1 |= (I2C_CR1_TXIE | I2C_CR1_STOPIE | I2C_CR1_TCIE);

        I2C->CR1 &= ~I2C_CR1_SBC;

        I2C->ISR |= I2C_ISR_TXE;
            
        if (i2c->tx_data)
        {
            I2C->TXDR = *(i2c->tx_data)++;

            if (i2c->tx_data == i2c->tx_data_e)
            {
                i2c->tx_data = NULL;
                i2c->tx_data_e = NULL;
            }
        }
        else
        {
            I2C->TXDR = 0xff;
        }
        
        i2c->xf_count++;
    }
    else
    {
        i2c->state = STM32L0_I2C_STATE_SLAVE_RECEIVE;

        i2c->rx_data = NULL;
        i2c->rx_data_e = NULL;

        (*i2c->ev_callback)(i2c->ev_context, STM32L0_I2C_EVENT_RECEIVE_REQUEST | (i2c->xf_address << STM32L0_I2C_EVENT_ADDRESS_SHIFT));

        I2C->CR2 = (I2C_CR2_RELOAD | (1 << I2C_CR2_NBYTES_SHIFT));
                
        I2C->CR1 |= (I2C_CR1_SBC | I2C_CR1_STOPIE | I2C_CR1_TCIE);
    }

    I2C->ICR = I2C_ICR_ADDRCF;
}

static __attribute__((optimize("O3"))) void stm32l0_i2c_interrupt(stm32l0_i2c_t *i2c)
{
    I2C_TypeDef *I2C = i2c->I2C;
    stm32l0_i2c_transaction_t *transaction = i2c->xf_transaction;
    uint32_t i2c_isr, i2c_cr2, count;

    i2c_isr = I2C->ISR;

    switch (i2c->state) {

    case STM32L0_I2C_STATE_NONE:
    case STM32L0_I2C_STATE_INIT:
        break;

    case STM32L0_I2C_STATE_READY:
        if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK)
        {
            if (i2c_isr & I2C_ISR_ADDR)
            {
                stm32l0_system_lock(STM32L0_SYSTEM_LOCK_SLEEP);

                stm32l0_i2c_slave_address(i2c);
            }
            else
            {
                stm32l0_i2c_slave_check(i2c);
            }
        }
        else
        {
            if (i2c->rq_sync)
            {
                stm32l0_i2c_sync(i2c);
            }

            stm32l0_i2c_master_check(i2c);
        }
        break;

    case STM32L0_I2C_STATE_SUSPENDED:
        break;
        
    case STM32L0_I2C_STATE_MASTER_STOP:
    case STM32L0_I2C_STATE_MASTER_RESTART:
        stm32l0_i2c_master_check(i2c);
        break;

    case STM32L0_I2C_STATE_MASTER_TRANSMIT:
        if (i2c_isr & I2C_ISR_TXIS)
        {
            if (!(I2C->CR1 & I2C_CR1_TXDMAEN))
            {
                I2C->TXDR = *(i2c->tx_data)++;
            }
        }

        if (i2c_isr & (I2C_ISR_TCR | I2C_ISR_TC | I2C_ISR_STOPF))
        {
            if (i2c_isr & (I2C_ISR_TC | I2C_ISR_STOPF))
            {
                I2C->CR1 &= ~(I2C_CR1_TXIE | I2C_CR1_STOPIE | I2C_CR1_TCIE);
                
                I2C->ICR = I2C_ICR_STOPCF;
                
                if (I2C->CR1 & I2C_CR1_TXDMAEN)
                {
                    i2c->tx_data = transaction->tx_data + stm32l0_dma_stop(i2c->tx_dma);
                    
                    I2C->CR1 &= ~I2C_CR1_TXDMAEN;
                }

                if (i2c_isr & (I2C_ISR_TIMEOUT | I2C_ISR_ARLO | I2C_ISR_NACKF))
                {
                    I2C->ICR = I2C_ICR_TIMOUTCF | I2C_ICR_ARLOCF | I2C_ICR_NACKCF;
                    
                    if (i2c_isr & I2C_ISR_NACKF)
                    {
                        if (!(i2c_isr & I2C_ISR_TXE))
                        {
                            i2c->tx_data--;
                        }

                        transaction->status = ((i2c->tx_data == transaction->tx_data) ? STM32L0_I2C_STATUS_TRANSMIT_ADDRESS_NACK : STM32L0_I2C_STATUS_TRANSMIT_DATA_NACK);
                    }
                    else
                    {
                        if (i2c_isr & I2C_ISR_ARLO)
                        {
                            transaction->status = STM32L0_I2C_STATUS_TRANSMIT_ARBITRATION_LOST;
                        }
                        else
                        {
                            transaction->status = STM32L0_I2C_STATUS_TRANSMIT_TIMEOUT;
                        }
                    }

                    i2c->state = STM32L0_I2C_STATE_MASTER_STOP;
                }
                else
                {
                    if (i2c->xf_control & STM32L0_I2C_CONTROL_RESTART)
                    {
                        i2c->state = STM32L0_I2C_STATE_MASTER_RESTART;
                    }
                    else
                    {
                        i2c->state = STM32L0_I2C_STATE_MASTER_STOP;
                    }

                    if (i2c->rx_data)
                    {
                        stm32l0_i2c_master_receive(i2c);
                    }
                    else
                    {
                        transaction->status = STM32L0_I2C_STATUS_SUCCESS;
                    }
                }

                if (transaction->status != STM32L0_I2C_STATUS_BUSY)
                {
                    i2c->xf_transaction = NULL;
                    
                    if (transaction->callback)
                    {
                        (*transaction->callback)(transaction->context);
                    }
                    
                    stm32l0_i2c_master_check(i2c);
                }
            }
            else /* I2C_ISR_TCR */
            {
                i2c_cr2 = I2C->CR2 & ~(I2C_CR2_AUTOEND | I2C_CR2_RELOAD | I2C_CR2_NBYTES | I2C_CR2_NACK | I2C_CR2_STOP | I2C_CR2_START);
                
                count = i2c->tx_data_e - i2c->tx_data;
                
                if (count > I2C_CR2_NBYTES_MAX)
                {
                    count = I2C_CR2_NBYTES_MAX;
                    
                    i2c_cr2 |= I2C_CR2_RELOAD;
                }
                else
                {
                    if (!i2c->rx_data && !(i2c->xf_control & STM32L0_I2C_CONTROL_RESTART))
                    {
                        i2c_cr2 |= I2C_CR2_AUTOEND;
                    }
                }
                
                I2C->CR2 = (i2c_cr2 | (count << I2C_CR2_NBYTES_SHIFT));
                
                if (I2C->CR1 & I2C_CR1_TXDMAEN)
                {
                    i2c->tx_data += count;
                }
                else
                {
                    if (I2C->ISR & I2C_ISR_TXE)
                    {
                        I2C->TXDR = *(i2c->tx_data)++;
                    }
                }
            }
        }
        break;

    case STM32L0_I2C_STATE_MASTER_RECEIVE:
        if (i2c_isr & I2C_ISR_RXNE)
        {
            if (!(I2C->CR1 & I2C_CR1_RXDMAEN))
            {
                *(i2c->rx_data)++ = I2C->RXDR;
            }
        }
        
        if (i2c_isr & (I2C_ISR_TCR | I2C_ISR_TC | I2C_ISR_STOPF))
        {
            if (i2c_isr & (I2C_ISR_TC | I2C_ISR_STOPF))
            {
                I2C->CR1 &= ~(I2C_CR1_RXIE | I2C_CR1_STOPIE | I2C_CR1_TCIE);

                I2C->ICR = I2C_ICR_STOPCF;
                
                if (I2C->CR1 & I2C_CR1_RXDMAEN)
                {
                    stm32l0_dma_stop(i2c->rx_dma);
                    
                    I2C->CR1 &= ~I2C_CR1_RXDMAEN;
                }
                
                if (i2c_isr & (I2C_ISR_TIMEOUT | I2C_ISR_ARLO | I2C_ISR_NACKF))
                {
                    I2C->ICR = I2C_ICR_TIMOUTCF | I2C_ICR_ARLOCF | I2C_ICR_NACKCF;
                    
                    if (i2c_isr & I2C_ISR_NACKF)
                    {
                        transaction->status = STM32L0_I2C_STATUS_RECEIVE_ADDRESS_NACK;
                    }
                    else
                    {
                        if (i2c_isr & I2C_ISR_ARLO)
                        {
                            transaction->status = STM32L0_I2C_STATUS_RECEIVE_ARBITRATION_LOST;
                        }
                        else
                        {
                            transaction->status = STM32L0_I2C_STATUS_RECEIVE_TIMEOUT;
                        }
                    }

