GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
                    i2c->state = STM32L0_I2C_STATE_MASTER_STOP;
                }
                else
                {
                    if (i2c->xf_control & STM32L0_I2C_CONTROL_RESTART)
                    {
                        i2c->state = STM32L0_I2C_STATE_MASTER_RESTART;
                    }
                    else
                    {
                        i2c->state = STM32L0_I2C_STATE_MASTER_STOP;
                    }
                    
                    transaction->status = STM32L0_I2C_STATUS_SUCCESS;
                }
                
                if (transaction->status != STM32L0_I2C_STATUS_BUSY)
                {
                    i2c->xf_transaction = NULL;

                    if (transaction->callback)
                    {
                        (*transaction->callback)(transaction->context);
                    }
                
                    stm32l0_i2c_master_check(i2c);
                }
            }
            else /* I2C_ISR_TCR */
            {
                i2c_cr2 = I2C->CR2 & ~(I2C_CR2_AUTOEND | I2C_CR2_RELOAD | I2C_CR2_NBYTES | I2C_CR2_NACK |  I2C_CR2_STOP | I2C_CR2_START);
                
                count = (i2c->rx_data_e - i2c->rx_data);
                
                if (count > 1)
                {
                    i2c_cr2 |= I2C_CR2_RELOAD;
                }
                else
                {
                    if (!(i2c->xf_control & STM32L0_I2C_CONTROL_RESTART))
                    {
                        i2c_cr2 |= I2C_CR2_AUTOEND;
                    }
                }
                        
                I2C->CR2 = (i2c_cr2 | (1 << I2C_CR2_NBYTES_SHIFT));
            }
        }
        break;

    case STM32L0_I2C_STATE_SLAVE_TRANSMIT:
        /* A slave transmit is terminated by a NACK followed by a STOP of the master receiver.
         */

        if (i2c_isr & (I2C_ISR_ADDR | I2C_ISR_STOPF))
        {
            I2C->ICR = I2C_ICR_NACKCF | I2C_ICR_STOPCF;

            I2C->CR1 &= ~(I2C_CR1_TXIE | I2C_CR1_STOPIE);
            
            /* If I2C_TXDR is not empty, there there is an unsent byte.
             */
            if (!(I2C->ISR & I2C_ISR_TXE))
            {
                i2c->xf_count--;
            }
            
            i2c->state = STM32L0_I2C_STATE_READY;
                
            (*i2c->ev_callback)(i2c->ev_context, STM32L0_I2C_EVENT_TRANSMIT_DONE | (i2c->xf_count << STM32L0_I2C_EVENT_COUNT_SHIFT));

            if (I2C->ISR & I2C_ISR_ADDR)
            {
                stm32l0_i2c_slave_address(i2c);
            }
            else
            {
                stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_SLEEP);

                stm32l0_i2c_slave_check(i2c);
            }
        }
        else
        {
            if (i2c_isr & I2C_ISR_TXIS)
            {
                if (i2c->tx_data)
                {
                    I2C->TXDR = *(i2c->tx_data)++;

                    if (i2c->tx_data == i2c->tx_data_e)
                    {
                        i2c->tx_data = NULL;
                        i2c->tx_data_e = NULL;
                    }
                }
                else
                {
                    I2C->TXDR = 0xff;
                }
                
                i2c->xf_count++;
            }
        }
        break;

    case STM32L0_I2C_STATE_SLAVE_RECEIVE:
        /* A slave receive is terminated either by STOP, or by a repeated
         * start, i.e. an ADDR match.
         */

        if (i2c_isr & (I2C_ISR_ADDR | I2C_ISR_STOPF))
        {
            I2C->ICR = I2C_ICR_NACKCF | I2C_ICR_STOPCF;

            I2C->CR1 &= ~(I2C_CR1_STOPIE | I2C_CR1_TCIE);
            
            i2c->state = STM32L0_I2C_STATE_READY;
                
            (*i2c->ev_callback)(i2c->ev_context, STM32L0_I2C_EVENT_RECEIVE_DONE | (i2c->xf_count << STM32L0_I2C_EVENT_COUNT_SHIFT));

            if (i2c_isr & I2C_ISR_ADDR)
            {
                stm32l0_i2c_slave_address(i2c);
            }
            else
            {
                stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_SLEEP);

                stm32l0_i2c_slave_check(i2c);
            }
        }
        else
        {
            if (i2c_isr & I2C_ISR_TCR)
            {
                i2c_cr2 = I2C->CR2 & ~(I2C_CR2_AUTOEND | I2C_CR2_RELOAD | I2C_CR2_NBYTES | I2C_CR2_NACK |  I2C_CR2_STOP | I2C_CR2_START);

                if (i2c->rx_data)
                {
                    *(i2c->rx_data)++ = I2C->RXDR;

                    i2c->xf_count++;
                    
                    if (i2c->rx_data == i2c->rx_data_e)
                    {
                        i2c->rx_data = NULL;
                        i2c->rx_data_e = NULL;
                    }
                }
                else
                {
                    I2C->RXDR;
                    
                    i2c_cr2 |= I2C_CR2_NACK;
                }

                I2C->CR2 = i2c_cr2 | I2C_CR2_RELOAD | (1 << I2C_CR2_NBYTES_SHIFT);
            }
        }
        break;
    }
}

bool stm32l0_i2c_create(stm32l0_i2c_t *i2c, const stm32l0_i2c_params_t *params)
{
    if (i2c->state != STM32L0_I2C_STATE_NONE)
    {
        return false;
    }

    i2c->I2C = stm32l0_i2c_xlate_I2C[params->instance];
    i2c->instance = params->instance;
    i2c->interrupt = stm32l0_i2c_xlate_IRQn[params->instance];
    i2c->priority = params->priority;
    i2c->rx_dma = params->rx_dma;
    i2c->tx_dma = params->tx_dma;
    i2c->pins = params->pins;

    stm32l0_i2c_device.instances[i2c->instance] = i2c;

    i2c->state = STM32L0_I2C_STATE_INIT;

    if (!stm32l0_i2c_device.notify.callback)
    {
        stm32l0_system_register(&stm32l0_i2c_device.notify, stm32l0_i2c_notify_callback, NULL, (STM32L0_SYSTEM_NOTIFY_STOP_ENTER | STM32L0_SYSTEM_NOTIFY_STOP_LEAVE));
    }

    return true;
}

bool stm32l0_i2c_destroy(stm32l0_i2c_t *i2c)
{
    if (i2c->state != STM32L0_I2C_STATE_INIT)
    {
        return false;
    }

    i2c->state = STM32L0_I2C_STATE_NONE;

    stm32l0_i2c_device.instances[i2c->instance] = NULL;

