GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_i2c.c
    return true;
}

bool stm32l0_i2c_enable(stm32l0_i2c_t *i2c, uint32_t option, uint32_t timeout, stm32l0_i2c_event_callback_t callback, void *context)
{
    if (i2c->state != STM32L0_I2C_STATE_INIT)
    {
        return false;
    }

    i2c->ev_callback = callback;
    i2c->ev_context = context;

    if (!stm32l0_i2c_configure(i2c, option, timeout))
    {
        return false;
    }

    if (i2c->instance == STM32L0_I2C_INSTANCE_I2C2)
    {
        stm32l0_system_reference(STM32L0_SYSTEM_REFERENCE_I2C2);
    }

    i2c->state = STM32L0_I2C_STATE_READY;

    NVIC_SetPriority(i2c->interrupt, i2c->priority);
    NVIC_EnableIRQ(i2c->interrupt);

    return true;
}

bool stm32l0_i2c_disable(stm32l0_i2c_t *i2c)
{
    if (i2c->state != STM32L0_I2C_STATE_READY)
    {
        return false;
    }

    NVIC_DisableIRQ(i2c->interrupt);

    if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK)
    {
        stm32l0_i2c_stop(i2c);

        armv6m_atomic_and(&EXTI->IMR, ~stm32l0_i2c_xlate_IMR[i2c->instance]);
    }

    armv6m_atomic_and(&SYSCFG->CFGR1, ~stm32l0_i2c_xlate_FMP[i2c->instance]);

    i2c->state = STM32L0_I2C_STATE_INIT;

    return true;
}

bool stm32l0_i2c_configure(stm32l0_i2c_t *i2c, uint32_t option, uint32_t timeout)
{
    if (i2c->state == STM32L0_I2C_STATE_NONE)
    {
        return false;
    }

    if (option & STM32L0_I2C_OPTION_ADDRESS_MASK)
    {
        if (i2c->instance == STM32L0_I2C_INSTANCE_I2C2)
        {
            return false;
        }
    }
    else
    {
        if (i2c->instance == STM32L0_I2C_INSTANCE_I2C2)
        {
            if (option & STM32L0_I2C_OPTION_MODE_1000K)
            {
                return false;
            }

            if (stm32l0_system_pclk1() < 4000000)
            {
                return false;
            }

            stm32l0_system_reference(STM32L0_SYSTEM_REFERENCE_I2C2);

            timeout = 0;
        }

        option &= ~STM32L0_I2C_OPTION_WAKEUP;
    }

    i2c->option = option;
    i2c->timeout = timeout;

    i2c->rq_sync = true;

    if (__current_irq() != i2c->interrupt)
    {
        NVIC_SetPendingIRQ(i2c->interrupt);
    }

    return true;
}

bool stm32l0_i2c_suspend(stm32l0_i2c_t *i2c, stm32l0_i2c_suspend_callback_t callback, void *context)
{
    if (i2c->rq_callback)
    {
        return false;
    }

    if (i2c->state < STM32L0_I2C_STATE_READY)
    {
        return false;
    }

    if (callback)
    {
        i2c->rq_context = context;
        i2c->rq_callback = callback;
    }
    else
    {
        i2c->rq_callback = STM32L0_I2C_SUSPEND_CALLBACK;
    }

    if (__current_irq() != i2c->interrupt)
    {
        NVIC_SetPendingIRQ(i2c->interrupt);
    }

    return true;
}

void stm32l0_i2c_resume(stm32l0_i2c_t *i2c)
{
    if (i2c->state == STM32L0_I2C_STATE_SUSPENDED)
    {
        i2c->rq_callback = NULL;

        if (i2c->option & STM32L0_I2C_OPTION_WAKEUP)
        {
            stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PARK_NONE | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
            stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PARK_NONE | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
        }
        else
        {
            stm32l0_gpio_pin_configure(i2c->pins.scl, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
            stm32l0_gpio_pin_configure(i2c->pins.sda, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_ALTERNATE));
        }
        
        if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK) 
        {
            stm32l0_i2c_start(i2c);
        }
        
        i2c->state = STM32L0_I2C_STATE_READY;
        
        NVIC_EnableIRQ(i2c->interrupt);
        
        NVIC_SetPendingIRQ(i2c->interrupt);
    }
}

bool stm32l0_i2c_reset(stm32l0_i2c_t *i2c)
{
    uint32_t pin_scl, pin_sda, count;

    if (i2c->state != STM32L0_I2C_STATE_SUSPENDED)
    {
        return false;
    }

    pin_scl = i2c->pins.scl;
    pin_sda = i2c->pins.sda;

    stm32l0_gpio_pin_configure(pin_scl, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
    stm32l0_gpio_pin_configure(pin_sda, (STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_HIGH | STM32L0_GPIO_OTYPE_OPENDRAIN | STM32L0_GPIO_MODE_INPUT));
    stm32l0_gpio_pin_write(pin_scl, 0);
    stm32l0_gpio_pin_write(pin_sda, 1);
    stm32l0_gpio_pin_output(pin_scl);
    stm32l0_gpio_pin_output(pin_sda);
    
    /* Clock 16 SCL cycles to force a slave to release SDA and then issue a manual STOP condition.
     * The spec suggest 9 SCL cycles, but in practice more are needed. 
     */
    
    for (count = 0; count < 16; count++)
    {
        armv6m_core_udelay(6);    
        
        /* Set SCL to H */ 
        stm32l0_gpio_pin_write(pin_scl, 1);
        armv6m_core_udelay(4);    
        
        /* Set SCL to L */ 
        stm32l0_gpio_pin_write(pin_scl, 0);
    }
    
    // Send a STOP condition (SCL = 1, SDA = 0 -> 1)
    armv6m_core_udelay(1);    
    stm32l0_gpio_pin_write(pin_sda, 0);
    armv6m_core_udelay(1);    
    stm32l0_gpio_pin_write(pin_scl, 1);
    armv6m_core_udelay(2);    
    stm32l0_gpio_pin_write(pin_sda, 1);
    armv6m_core_udelay(40);    

    stm32l0_gpio_pin_input(pin_sda);
    stm32l0_gpio_pin_input(pin_scl);

    return true;
}

bool stm32l0_i2c_receive(stm32l0_i2c_t *i2c, uint8_t *rx_data, uint16_t rx_count)
{
    if (i2c->state != STM32L0_I2C_STATE_SLAVE_RECEIVE)
    {
        return false;
    }

    if (rx_count)
    {
        i2c->rx_data = rx_data;
        i2c->rx_data_e = rx_data + rx_count;
    }

    return true;
}

bool stm32l0_i2c_transmit(stm32l0_i2c_t *i2c, uint8_t *tx_data, uint16_t tx_count)
{
    if (i2c->state != STM32L0_I2C_STATE_SLAVE_TRANSMIT)
    {
        return false;
    }

    if (tx_count)
    {
        i2c->tx_data = tx_data;
        i2c->tx_data_e = tx_data + tx_count;
    }

    return true;
}

bool stm32l0_i2c_submit(stm32l0_i2c_t *i2c, stm32l0_i2c_transaction_t *transaction)
{
    stm32l0_i2c_transaction_t *entry;

    if (i2c->state < STM32L0_I2C_STATE_READY)
    {
        return false;
    }

    if (i2c->option & STM32L0_I2C_OPTION_ADDRESS_MASK)
    {
        return false;
    }

    if (!transaction->tx_data && !transaction->rx_data)
    {
        return false;
    }

    transaction->status = STM32L0_I2C_STATUS_BUSY;

    do
    {
        entry = i2c->xf_queue;
        transaction->next = entry;
    }
    while (armv6m_atomic_cas((volatile uint32_t*)&i2c->xf_queue, (uint32_t)entry, (uint32_t)transaction) != (uint32_t)entry);

    if (__current_irq() != i2c->interrupt)
    {
        NVIC_SetPendingIRQ(i2c->interrupt);
    }

    return true;
}

void I2C1_IRQHandler(void)
{
    stm32l0_i2c_interrupt(stm32l0_i2c_device.instances[STM32L0_I2C_INSTANCE_I2C1]);
}

void I2C2_IRQHandler(void)
{
    stm32l0_i2c_interrupt(stm32l0_i2c_device.instances[STM32L0_I2C_INSTANCE_I2C2]);
}

#if defined(STM32L072xx) || defined(STM32L082xx)

void I2C3_IRQHandler(void)
{
    stm32l0_i2c_interrupt(stm32l0_i2c_device.instances[STM32L0_I2C_INSTANCE_I2C3]);
}

#endif /* STM32L072xx || STM32L082xx */

